pnt325/TMS570LC4357-CAN-Bootloader/source/hercules_examples/TI_Design/TIDEP-01014/TMS570LS1224_TCAN4550_Demo_Node1/tcan4550/TMS570_TCAN45x.h
/*****************************************************************************
*
* TMS570_TCAN45x.h  : Functions to burst read and write from/to TCAN4550
*
* Updated by: QJ Wang, Dat3: May 15, 2018
* Version 1.4
* Changes Notes:
* --using 1 function to replace 3 functions
* --using SPI cshold instead of GIO as spi cs
*
* Updated by: Jonathan Valdez, Date: 8/3/2017
* Version: 1.3
*
* Change Notes 1.3 (8/3/2017):
* - Cleaning up function names
* - Getting rid of unused functions
*
* Change Notes 1.2 (4/23/2017):
* - Changed defines for latest register map
*
* Change Notes 1.1:
* - Modified code to make sure SPI byte is complete to prevent race condition on MSP430
* - Made 32-bit functions more efficient by doing direct memory reads rather than bitwise ands and then shift operations
******************************************************************************/
/*
* Copyright (C) 2009-2015 Texas Instruments Incorporated - www.ti.com
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the
*    distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  INCLUDING NEGLIGENCE OR OTHERWISE ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
*/

#include "sys_common.h"

//AHB Burst Write Fixed Length 	0x61 - 4 address bytes, 2 length bytes, 32 bytes to write
uint32_t AHB_WRITE_B_FL_32(uint16_t address, uint32_t data);

//AHB Burst Read Fixed Length 	0x41 - 4 address bytes, 2 length bytes, 32 bytes to read data
uint32_t AHB_READ_B_FL_32(uint16_t address);

/* Burst read with a 1 dummy read byte*/
uint32_t AHB_READ_B_FL_32_WAIT(uint16_t address);

/*AHB Burst Write varied Length of data*/
uint32_t AHB_Write_Burst(uint16_t address, uint8_t* dataBuff, uint32_t len);

/* AHB Burst Write varied Length */
uint32_t AHB_Read_Burst(uint16_t address, uint8_t DataLength, uint8_t * destbuff);

/* Burst read with a 1 dummy read byte*/
uint32_t AHB_Read_Burst_Wait(uint16_t address, uint8_t DataLength, uint8_t * destbuff);

//-----------------------------------------------------------------------------------------------

//AHB Access Commands
//*****************************************************************************
#define AHB_WRITE_B_FL_OPCODE				0x61
#define AHB_READ_B_FL_OPCODE				0x41
#define AHB_READ_B_FL_WAIT_OPCODE           0x85

//*****************************************************************************


//*****************************************************************************
//Register Address Sections
//*****************************************************************************
#define SPI_CONFIG							0x0000
#define DEV_CONFIG							0x0800
#define MCAN								0x1000
#define PN									0x2000
#define MRAM								0x8000
#define MRAM_SIZE							2048

//*****************************************************************************
// SPI Registers and Device ID Register Addresses: 	0x0000 Prefix
//*****************************************************************************
#define SPI_DEVICE_ID0						0x0000
#define SPI_DEVICE_ID1						0x0004
#define SPI_REVISION						0x0008
#define SPI_STATUS							0x000C
#define SPI_ERROR_STATUS_MASK				0x0010
#define SPI_CONTROL							0x0014
#define SPI_MISC							0x0018


//*****************************************************************************
// Device Configuration Register Addresses: 	0x0800 Prefix
//*****************************************************************************
#define DEV_MODE_PINS						0x0800
#define DEV_TIMESTAMP_PRESCALER				0x0804
#define DEV_TEST_REGISTERS					0x0808
#define DEV_IR                              0x0820
#define DEV_IE								0x0830


//*****************************************************************************
// MCAN Register Addresses: 	0x1000 Prefix
//*****************************************************************************
#define M_CAN_CREL							0x1000
#define M_CAN_ENDN							0x1004
#define M_CAN_CUST							0x1008
#define M_CAN_DBTP							0x100C
#define M_CAN_TEST							0x1010
#define M_CAN_RWD							0x1014
#define M_CAN_CCCR							0x1018
#define M_CAN_NBTP							0x101C
#define M_CAN_TSCC							0x1020
#define M_CAN_TSCV							0x1024
#define M_CAN_TOCC							0x1028
#define M_CAN_TOCV							0x102C
#define M_CAN_ECR							0x1040
#define M_CAN_PSR							0x1044
#define M_CAN_TDCR							0x1048
#define M_CAN_IR							0x1050
#define M_CAN_IE							0x1054
#define M_CAN_ILS							0x1058
#define M_CAN_ILE							0x105C
#define M_CAN_GFC							0x1080
#define M_CAN_SIDFC							0x1084
#define M_CAN_XIDFC							0x1088
#define M_CAN_XIDAM							0x1090
#define M_CAN_HPMS							0x1094
#define M_CAN_NDAT1							0x1098
#define M_CAN_NDAT2							0x109C
#define M_CAN_RXF0C							0x10A0
#define M_CAN_RXF0S							0x10A4
#define M_CAN_RXF0A							0x10A8
#define M_CAN_RXBC							0x10AC
#define M_CAN_RXF1C							0x10B0
#define M_CAN_RXF1S							0x10B4
#define M_CAN_RXF1A							0x10B8
#define M_CAN_RXESC							0x10BC
#define M_CAN_TXBC							0x10C0
#define M_CAN_TXFQS							0x10C4
#define M_CAN_TXESC							0x10C8
#define M_CAN_TXBRP							0x10CC
#define M_CAN_TXBAR							0x10D0
#define M_CAN_TXBCR							0x10D4
#define M_CAN_TXBTO							0x10D8
#define M_CAN_TXBCF							0x10DC
#define M_CAN_TXBTIE						0x10E0
#define M_CAN_TXBCIE						0x10E4
#define M_CAN_TXEFC							0x10F0
#define M_CAN_TXEFS							0x10F4
#define M_CAN_TXEFA							0x10F8
//*****************************************************************************

//DBTP
#define MCAN_DBTP_TDC_EN					0x00800000

//TEST
#define MCAN_TEST_RX_DOM					0x00000000
#define MCAN_TEST_RX_REC					0x00000080
#define MCAN_TEST_TX_SP						0x00000020
#define MCAN_TEST_TX_DOM					0x00000040
#define MCAN_TEST_TX_REC					0x00000060
#define MCAN_TEST_LOOP_BACK					0x00000010

//CCCR
#define MCAN_CCCR_NISO_ISO					0x00000000
#define MCAN_CCCR_NISO_BOSCH				0x00008000
#define MCAN_CCCR_TXP						0x00004000
#define MCAN_CCCR_EFBI						0x00002000
#define MCAN_CCCR_PXHD_DIS					0x00001000
#define MCAN_CCCR_BRSE						0x00000200
#define MCAN_CCCR_FDOE						0x00000100
#define MCAN_CCCR_TEST						0x00000080
#define MCAN_CCCR_DAR_DIS					0x00000040
#define MCAN_CCCR_MON						0x00000020
#define MCAN_CCCR_CSR						0x00000010
#define MCAN_CCCR_CSA						0x00000008
#define MCAN_CCCR_ASM						0x00000004
#define MCAN_CCCR_CCE						0x00000002
#define MCAN_CCCR_INIT						0x00000001

//IE
#define MCAN_IE_ARAE						0x20000000
#define MCAN_IE_PEDE						0x10000000
#define MCAN_IE_PEAE						0x08000000
#define MCAN_IE_WDIE						0x04000000
#define MCAN_IE_BOE							0x02000000
#define MCAN_IE_EWE							0x01000000
#define MCAN_IE_EPE							0x00800000
#define MCAN_IE_ELOE						0x00400000
#define MCAN_IE_BEUE						0x00200000
#define MCAN_IE_BECE						0x00100000
#define MCAN_IE_DRXE						0x00080000
#define MCAN_IE_TOOE						0x00040000
#define MCAN_IE_MRAFE						0x00020000
#define MCAN_IE_TSWE						0x00010000
#define MCAN_IE_TEFLE						0x00008000
#define MCAN_IE_TEFFE						0x00004000
#define MCAN_IE_TEFWE						0x00002000
#define MCAN_IE_TEFNE						0x00001000
#define MCAN_IE_TFEE						0x00000800
#define MCAN_IE_TCFE						0x00000400
#define MCAN_IE_TCE							0x00000200
#define MCAN_IE_HPME						0x00000100
#define MCAN_IE_RF1LE						0x00000080
#define MCAN_IE_RF1FE						0x00000040
#define MCAN_IE_RF1WE						0x00000020
#define MCAN_IE_RF1NE						0x00000010
#define MCAN_IE_RF0LE						0x00000008
#define MCAN_IE_RF0FE						0x00000004
#define MCAN_IE_RF0WE						0x00000002
#define MCAN_IE_RF0NE						0x00000001

//IR
#define MCAN_IR_ARA							0x20000000
#define MCAN_IR_PED							0x10000000
#define MCAN_IR_PEA							0x08000000
#define MCAN_IR_WDI							0x04000000
#define MCAN_IR_BO							0x02000000
#define MCAN_IR_EW							0x01000000
#define MCAN_IR_EP							0x00800000
#define MCAN_IR_ELO							0x00400000
#define MCAN_IR_BEU							0x00200000
#define MCAN_IR_BEC							0x00100000
#define MCAN_IR_DRX							0x00080000
#define MCAN_IR_TOO							0x00040000
#define MCAN_IR_MRAF						0x00020000
#define MCAN_IR_TSW							0x00010000
#define MCAN_IR_TEFL						0x00008000
#define MCAN_IR_TEFF						0x00004000
#define MCAN_IR_TEFW						0x00002000
#define MCAN_IR_TEFN						0x00001000
#define MCAN_IR_TFE							0x00000800
#define MCAN_IR_TCF							0x00000400
#define MCAN_IR_TC							0x00000200
#define MCAN_IR_HPM							0x00000100
#define MCAN_IR_RF1L						0x00000080
#define MCAN_IR_RF1F						0x00000040
#define MCAN_IR_RF1W						0x00000020
#define MCAN_IR_RF1N						0x00000010
#define MCAN_IR_RF0L						0x00000008
#define MCAN_IR_RF0F						0x00000004
#define MCAN_IR_RF0W						0x00000002
#define MCAN_IR_RF0N						0x00000001

