pnt325/TMS570LC4357-CAN-Bootloader/source/hercules_examples/TI_Design/TIDEP-01014/TMS570LS1224_TCAN4550_Demo_Node1/tcan4550/TMS570_TCAN45x.h
//ILS
#define MCAN_IE_ARAL						0x20000000
#define MCAN_IE_PEDL						0x10000000
#define MCAN_IE_PEAL						0x08000000
#define MCAN_IE_WDIL						0x04000000
#define MCAN_IE_BOL							0x02000000
#define MCAN_IE_EWL							0x01000000
#define MCAN_IE_EPL							0x00800000
#define MCAN_IE_ELOL						0x00400000
#define MCAN_IE_BEUL						0x00200000
#define MCAN_IE_BECL						0x00100000
#define MCAN_IE_DRXL						0x00080000
#define MCAN_IE_TOOL						0x00040000
#define MCAN_IE_MRAFL						0x00020000
#define MCAN_IE_TSWL						0x00010000
#define MCAN_IE_TEFLL						0x00008000
#define MCAN_IE_TEFFL						0x00004000
#define MCAN_IE_TEFWL						0x00002000
#define MCAN_IE_TEFNL						0x00001000
#define MCAN_IE_TFEL						0x00000800
#define MCAN_IE_TCFL						0x00000400
#define MCAN_IE_TCL							0x00000200
#define MCAN_IE_HPML						0x00000100
#define MCAN_IE_RF1LL						0x00000080
#define MCAN_IE_RF1FL						0x00000040
#define MCAN_IE_RF1WL						0x00000020
#define MCAN_IE_RF1NL						0x00000010
#define MCAN_IE_RF0LL						0x00000008
#define MCAN_IE_RF0FL						0x00000004
#define MCAN_IE_RF0WL						0x00000002
#define MCAN_IE_RF0NL						0x00000001

//ILE
#define MCAN_ILE_EINT1						0x00000002
#define MCAN_ILE_EINT0						0x00000001

//GFC
#define MCAN_GFC_ANFS_FIFO0					0x00000000
#define MCAN_GFC_ANFS_FIFO1					0x00000010
#define MCAN_GFC_ANFE_FIFO0					0x00000000
#define MCAN_GFC_ANFE_FIFO1					0x00000004
#define MCAN_GFC_RRFS						0x00000002
#define MCAN_GFC_RRFE						0x00000001

//NDAT1

//NDAT2

//RXF0C
#define MCAN_RXF0C_F0OM_OVERWRITE			0x80000000

//RXESC
#define MCAN_RXESC_RBDS_8B					0x00000000
#define MCAN_RXESC_RBDS_12B					0x00000100
#define MCAN_RXESC_RBDS_16B					0x00000200
#define MCAN_RXESC_RBDS_20B					0x00000300
#define MCAN_RXESC_RBDS_24B					0x00000400
#define MCAN_RXESC_RBDS_32B					0x00000500
#define MCAN_RXESC_RBDS_48B					0x00000600
#define MCAN_RXESC_RBDS_64B					0x00000700
#define MCAN_RXESC_F1DS_8B					0x00000000
#define MCAN_RXESC_F1DS_12B					0x00000010
#define MCAN_RXESC_F1DS_16B					0x00000020
#define MCAN_RXESC_F1DS_20B					0x00000030
#define MCAN_RXESC_F1DS_24B					0x00000040
#define MCAN_RXESC_F1DS_32B					0x00000050
#define MCAN_RXESC_F1DS_48B					0x00000060
#define MCAN_RXESC_F1DS_64B					0x00000070
#define MCAN_RXESC_F0DS_8B					0x00000000
#define MCAN_RXESC_F0DS_12B					0x00000001
#define MCAN_RXESC_F0DS_16B					0x00000002
#define MCAN_RXESC_F0DS_20B					0x00000003
#define MCAN_RXESC_F0DS_24B					0x00000004
#define MCAN_RXESC_F0DS_32B					0x00000005
#define MCAN_RXESC_F0DS_48B					0x00000006
#define MCAN_RXESC_F0DS_64B					0x00000007

//TXBC
#define MCAN_TXBC_TFQM						0x40000000

//TXESC
#define MCAN_TXESC_TBDS_8					0x00000000
#define MCAN_TXESC_TBDS_12					0x00000001
#define MCAN_TXESC_TBDS_16					0x00000002
#define MCAN_TXESC_TBDS_20					0x00000003
#define MCAN_TXESC_TBDS_24					0x00000004
#define MCAN_TXESC_TBDS_32					0x00000005
#define MCAN_TXESC_TBDS_48					0x00000006
#define MCAN_TXESC_TBDS_64					0x00000007

//DLC
#define MCAN_DLC_0B							0x00000000
#define MCAN_DLC_1B							0x00000001
#define MCAN_DLC_2B							0x00000002
#define MCAN_DLC_3B							0x00000003
#define MCAN_DLC_4B							0x00000004
#define MCAN_DLC_5B							0x00000005
#define MCAN_DLC_6B							0x00000006
#define MCAN_DLC_7B							0x00000007
#define MCAN_DLC_8B							0x00000008
#define MCAN_DLC_12B						0x00000009
#define MCAN_DLC_16B						0x0000000A
#define MCAN_DLC_20B						0x0000000B
#define MCAN_DLC_24B						0x0000000C
#define MCAN_DLC_32B						0x0000000D
#define MCAN_DLC_48B						0x0000000E
#define MCAN_DLC_64B						0x0000000F

//TSCC
#define MCAN_TSCC_0							0x00000000
#define MCAN_TSCC_1							0x00000001
#define MCAN_TSCC_2							0x00000002

//TXBAR
#define MCAN_TXBAR_AR31						0x80000000
#define MCAN_TXBAR_AR30						0x40000000
#define MCAN_TXBAR_AR29						0x20000000
#define MCAN_TXBAR_AR28						0x10000000
#define MCAN_TXBAR_AR27						0x08000000
#define MCAN_TXBAR_AR26						0x04000000
#define MCAN_TXBAR_AR25						0x02000000
#define MCAN_TXBAR_AR24						0x01000000
#define MCAN_TXBAR_AR23						0x00800000
#define MCAN_TXBAR_AR22						0x00400000
#define MCAN_TXBAR_AR21						0x00200000
#define MCAN_TXBAR_AR20						0x00100000
#define MCAN_TXBAR_AR19						0x00080000
#define MCAN_TXBAR_AR18						0x00040000
#define MCAN_TXBAR_AR17						0x00020000
#define MCAN_TXBAR_AR16						0x00010000
#define MCAN_TXBAR_AR15						0x00008000
#define MCAN_TXBAR_AR14						0x00004000
#define MCAN_TXBAR_AR13						0x00002000
#define MCAN_TXBAR_AR12						0x00001000
#define MCAN_TXBAR_AR11						0x00000800
#define MCAN_TXBAR_AR10						0x00000400
#define MCAN_TXBAR_AR9						0x00000200
#define MCAN_TXBAR_AR8						0x00000100
#define MCAN_TXBAR_AR7						0x00000080
#define MCAN_TXBAR_AR6						0x00000040
#define MCAN_TXBAR_AR5						0x00000020
#define MCAN_TXBAR_AR4						0x00000010
#define MCAN_TXBAR_AR3						0x00000008
#define MCAN_TXBAR_AR2						0x00000004
#define MCAN_TXBAR_AR1						0x00000002
#define MCAN_TXBAR_AR0						0x00000001

//TXBCR
#define MCAN_TXBCR_CR31						0x80000000
#define MCAN_TXBCR_CR30						0x40000000
#define MCAN_TXBCR_CR29						0x20000000
#define MCAN_TXBCR_CR28						0x10000000
#define MCAN_TXBCR_CR27						0x08000000
#define MCAN_TXBCR_CR26						0x04000000
#define MCAN_TXBCR_CR25						0x02000000
#define MCAN_TXBCR_CR24						0x01000000
#define MCAN_TXBCR_CR23						0x00800000
#define MCAN_TXBCR_CR22						0x00400000
#define MCAN_TXBCR_CR21						0x00200000
#define MCAN_TXBCR_CR20						0x00100000
#define MCAN_TXBCR_CR19						0x00080000
#define MCAN_TXBCR_CR18						0x00040000
#define MCAN_TXBCR_CR17						0x00020000
#define MCAN_TXBCR_CR16						0x00010000
#define MCAN_TXBCR_CR15						0x00008000
#define MCAN_TXBCR_CR14						0x00004000
#define MCAN_TXBCR_CR13						0x00002000
#define MCAN_TXBCR_CR12						0x00001000
#define MCAN_TXBCR_CR11						0x00000800
#define MCAN_TXBCR_CR10						0x00000400
#define MCAN_TXBCR_CR9						0x00000200
#define MCAN_TXBCR_CR8						0x00000100
#define MCAN_TXBCR_CR7						0x00000080
#define MCAN_TXBCR_CR6						0x00000040
#define MCAN_TXBCR_CR5						0x00000020
#define MCAN_TXBCR_CR4						0x00000010
#define MCAN_TXBCR_CR3						0x00000008
#define MCAN_TXBCR_CR2						0x00000004
#define MCAN_TXBCR_CR1						0x00000002
#define MCAN_TXBCR_CR0						0x00000001

