pnt325/TMS570LC4357-CAN-Bootloader/source/hercules_examples/TI_Design/TIDEP-01014/TMS570LS1224_TCAN4550_Demo_Node1/tcan4550/TMS570_TCAN45x.h
//TXBTIE
#define MCAN_TXBTIE_TIE31					0x80000000
#define MCAN_TXBTIE_TIE30					0x40000000
#define MCAN_TXBTIE_TIE29					0x20000000
#define MCAN_TXBTIE_TIE28					0x10000000
#define MCAN_TXBTIE_TIE27					0x08000000
#define MCAN_TXBTIE_TIE26					0x04000000
#define MCAN_TXBTIE_TIE25					0x02000000
#define MCAN_TXBTIE_TIE24					0x01000000
#define MCAN_TXBTIE_TIE23					0x00800000
#define MCAN_TXBTIE_TIE22					0x00400000
#define MCAN_TXBTIE_TIE21					0x00200000
#define MCAN_TXBTIE_TIE20					0x00100000
#define MCAN_TXBTIE_TIE19					0x00080000
#define MCAN_TXBTIE_TIE18					0x00040000
#define MCAN_TXBTIE_TIE17					0x00020000
#define MCAN_TXBTIE_TIE16					0x00010000
#define MCAN_TXBTIE_TIE15					0x00008000
#define MCAN_TXBTIE_TIE14					0x00004000
#define MCAN_TXBTIE_TIE13					0x00002000
#define MCAN_TXBTIE_TIE12					0x00001000
#define MCAN_TXBTIE_TIE11					0x00000800
#define MCAN_TXBTIE_TIE10					0x00000400
#define MCAN_TXBTIE_TIE9					0x00000200
#define MCAN_TXBTIE_TIE8					0x00000100
#define MCAN_TXBTIE_TIE7					0x00000080
#define MCAN_TXBTIE_TIE6					0x00000040
#define MCAN_TXBTIE_TIE5					0x00000020
#define MCAN_TXBTIE_TIE4					0x00000010
#define MCAN_TXBTIE_TIE3					0x00000008
#define MCAN_TXBTIE_TIE2					0x00000004
#define MCAN_TXBTIE_TIE1					0x00000002
#define MCAN_TXBTIE_TIE0					0x00000001

//TXBCIE
#define MCAN_TXBCIE_CFIE31					0x80000000
#define MCAN_TXBCIE_CFIE30					0x40000000
#define MCAN_TXBCIE_CFIE29					0x20000000
#define MCAN_TXBCIE_CFIE28					0x10000000
#define MCAN_TXBCIE_CFIE27					0x08000000
#define MCAN_TXBCIE_CFIE26					0x04000000
#define MCAN_TXBCIE_CFIE25					0x02000000
#define MCAN_TXBCIE_CFIE24					0x01000000
#define MCAN_TXBCIE_CFIE23					0x00800000
#define MCAN_TXBCIE_CFIE22					0x00400000
#define MCAN_TXBCIE_CFIE21					0x00200000
#define MCAN_TXBCIE_CFIE20					0x00100000
#define MCAN_TXBCIE_CFIE19					0x00080000
#define MCAN_TXBCIE_CFIE18					0x00040000
#define MCAN_TXBCIE_CFIE17					0x00020000
#define MCAN_TXBCIE_CFIE16					0x00010000
#define MCAN_TXBCIE_CFIE15					0x00008000
#define MCAN_TXBCIE_CFIE14					0x00004000
#define MCAN_TXBCIE_CFIE13					0x00002000
#define MCAN_TXBCIE_CFIE12					0x00001000
#define MCAN_TXBCIE_CFIE11					0x00000800
#define MCAN_TXBCIE_CFIE10					0x00000400
#define MCAN_TXBCIE_CFIE9					0x00000200
#define MCAN_TXBCIE_CFIE8					0x00000100
#define MCAN_TXBCIE_CFIE7					0x00000080
#define MCAN_TXBCIE_CFIE6					0x00000040
#define MCAN_TXBCIE_CFIE5					0x00000020
#define MCAN_TXBCIE_CFIE4					0x00000010
#define MCAN_TXBCIE_CFIE3					0x00000008
#define MCAN_TXBCIE_CFIE2					0x00000004
#define MCAN_TXBCIE_CFIE1					0x00000002
#define MCAN_TXBCIE_CFIE0					0x00000001


/* ************************************ *
 * 			DEVICE REGISTERS			*
 * ************************************ */

// Modes of Operation and Pin Configuration Registers (0x0800)
//Wake pin
#define DEVICE_MODE_WAKE_PIN_DIS			0x00000000
#define DEVICE_MODE_WAKE_PIN_RISING			0x40000000
#define DEVICE_MODE_WAKE_PIN_FALLING		0x80000000
#define DEVICE_MODE_WAKE_PIN_BOTHEDGE		0xC0000000
//WD_Timer
#define DEVICE_MODE_WD_TIMER_MASK			0x30000000
#define DEVICE_MODE_WD_TIMER_8MS			0x00000000
#define DEVICE_MODE_WD_TIMER_16MS			0x10000000
#define DEVICE_MODE_WD_TIMER_24MS			0x20000000
#define DEVICE_MODE_WD_TIMER_32MS			0x30000000
//WD_TIMER_CLK_REF
#define DEVICE_MODE_WD_CLK_20MHZ			0x03000000
#define DEVICE_MODE_WD_CLK_25MHZ			0x04000000
#define DEVICE_MODE_WD_CLK_30MHZ			0x05000000
#define DEVICE_MODE_WD_CLK_35MHZ			0x06000000
#define DEVICE_MODE_WD_CLK_40MHZ			0x07000000
#define DEVICE_MODE_WD_CLK_45MHZ			0x08000000
#define DEVICE_MODE_WD_CLK_50MHZ			0x09000000
#define DEVICE_MODE_WD_CLK_55MHZ			0x0A000000
#define DEVICE_MODE_WD_CLK_60MHZ			0x0B000000
//GPO2 Pin Configuration
#define DEVICE_MODE_GPO2_CAN_FAULT			0x00000000
#define DEVICE_MODE_GPO2_MCAN_INT0			0x00400000
#define DEVICE_MODE_GPO2_WDT				0x00800000
#define DEVICE_MODE_GPO2_NINT				0x00C00000
//GPO2 Pin Function Select
#define DEVICE_MODE_GPO2_INPUT				0x00200000
#define DEVICE_MODE_GPO2_OUTPUT				0x00000000
//GPIO2 Pin GPI Function Select
#define DEVICE_MODE_GPO2_WDT_INPUT			0x00000000
//nWKRQ Pin GPO Voltage Rail COnfiguration
#define DEVICE_MODE_NWKRQ_VOLT_INTERNAL		0x00000000
#define DEVICE_MODE_NWKRQ_VOLT_VIO			0x00080000
//WD_BIT
#define DEVICE_MODE_WDT_RESET_BIT			0x00040000
//WD_ACTION
#define DEVICE_MODE_WDT_ACTION_INT			0x00000000
#define DEVICE_MODE_WDT_ACTION_INH_PULSE	0x00010000
#define DEVICE_MODE_WDT_ACTION_WDT_PULSE	0x00020000
//CLKOUT/GPO1 Pin Mode Select
#define DEVICE_MODE_GPO1_MODE_GPO			0x00000000
#define DEVICE_MODE_GPO1_MODE_CLKOUT		0x00004000
#define DEVICE_MODE_GPO1_MODE_GPI			0x00008000
//CLKOUT Prescaler
#define DEVICE_MODE_CLKOUT_1DIV				0x00000000
#define DEVICE_MODE_CLKOUT_2DIV				0x00001000
#define DEVICE_MODE_CLKOUT_4DIV				0x00002000
#define DEVICE_MODE_CLKOUT_8DIV				0x00003000
//GPO1 Function Select
#define DEVICE_MODE_GPO1_FUNC_SPI_INT		0x00000000
#define DEVICE_MODE_GPO1_FUNC_MCAN_INT1		0x00000400
#define DEVICE_MODE_GPO1_FUNC_UVLO_THERM	0x00000800
#define DEVICE_MODE_GPO1_FUNC_WDT_EVENT		0x00000C00
//INH Pin Disable
#define DEVICE_MODE_INH_DIS					0x00000200
#define DEVICE_MODE_INH_EN					0x00000000
//Mode of Operation
#define GPIO2_CONFIG_MASK                   0x00C00000  //QJ
#define GPIO1_CONFIG_MASK                   0x0000CC00  //QJ
#define DEVICE_MODE_DEVICEMODE_MASK			0x000000C0
#define DEVICE_MODE_DEVICEMODE_SLEEP		0x00000000
#define DEVICE_MODE_DEVICEMODE_STANDBY		0x00000040
#define DEVICE_MODE_DEVICEMODE_NORMAL		0x00000080
#define DEVICE_MODE_DEVICEMODE_TEST			0x000000C0
//MCAN_CONFIG
#define DEVICE_MODE_MCAN_NOTCONFIGURED		0x00000000
#define DEVICE_MODE_MCAN_CONFIGURED			0x00000020
//Selective Wake
#define DEVICE_MODE_SELECTIVEWAKE_EN		0x00000010
#define DEVICE_MODE_SELECTIVEWAKE_DIS		0x00000000
//WDT_DIS
#define DEVICE_MODE_WDT_EN					0x00000008
#define DEVICE_MODE_WDT_DIS					0x00000000
//Dev Reset
#define DEVICE_MODE_DEVICE_RESET			0x00000004
//Test Mode Configuration
#define DEVICE_MODE_TESTMODE_NORMAL			0x00000000
#define DEVICE_MODE_TESTMODE_CANTEST		0x00000001
#define DEVICE_MODE_TESTMODE_LOOP			0x00000002
#define DEVICE_MODE_TESTMODE_DIGLOOP		0x00000003



// Device Interrupt Register values
#define DEVICE_IR_CANBUSNOM					0x80000000
#define DEVICE_IR_CANBUSTERMOPEN			0x40000000
#define DEVICE_IR_CANHCANL					0x20000000
#define DEVICE_IR_CANHBAT					0x10000000
#define DEVICE_IR_CANLGND					0x08000000
#define DEVICE_IR_CANBUSOPEN				0x04000000
#define DEVICE_IR_CANBUSGND					0x02000000
#define DEVICE_IR_CANBUSBAT					0x01000000
#define DEVICE_IR_UVCCOUT					0x00800000
#define DEVICE_IR_UVSUP						0x00400000
#define DEVICE_IR_UVIO						0x00200000
#define DEVICE_IR_PWRON						0x00100000
#define DEVICE_IR_TSD						0x00080000
#define DEVICE_IR_WDTO						0x00040000
//Reserved									0x00020000
#define DEVICE_IR_ECCERR					0x00010000
#define DEVICE_IR_CANINT					0x00008000
#define DEVICE_IR_LWU						0x00004000
#define DEVICE_IR_WKERR						0x00002000
#define DEVICE_IR_FRAME_OVF					0x00001000
//Reserved									0x00000800
#define DEVICE_IR_CANSLNT					0x00000400
#define DEVICE_IR_CANTO						0x00000200
#define DEVICE_IR_CANDOM					0x00000100
#define DEVICE_IR_GLOBALERR					0x00000080
#define DEVICE_IR_nWKRQ						0x00000040
#define DEVICE_IR_CANERR					0x00000020
#define DEVICE_IR_CBF						0x00000010
#define DEVICE_IR_SPIERR					0x00000008
#define DEVICE_IR_SWERR						0x00000004
#define DEVICE_IR_M_CAN_INT					0x00000002
#define DEVICE_IR_VTWD						0x00000001

