pnt325/TMS570LC4357-CAN-Bootloader/source/hercules_examples/TI_Design/TIDEP-01014/TMS570LS1224_TCAN4550_Demo_Node1/tcan4550/TMS570_TCAN45x.h
// Device Interrupt Enable Register values
#define DEVICE_IE_CANBUSNOM					0x80000000
#define DEVICE_IE_CANBUSTERMOPEN			0x40000000
#define DEVICE_IE_CANHCANL					0x20000000
#define DEVICE_IE_CANHBAT					0x10000000
#define DEVICE_IE_CANLGND					0x08000000
#define DEVICE_IE_CANBUSOPEN				0x04000000
#define DEVICE_IE_CANBUSGND					0x02000000
#define DEVICE_IE_CANBUSBAT					0x01000000
#define DEVICE_IE_UVCCOUT					0x00800000
#define DEVICE_IE_UVSUP						0x00400000
#define DEVICE_IE_UVIO						0x00200000
#define DEVICE_IE_PWRON						0x00100000
#define DEVICE_IE_TSD						0x00080000
#define DEVICE_IE_WDTO						0x00040000
#define DEVICE_IE_SWCFG						0x00020000
#define DEVICE_IE_ECCERR					0x00010000
#define DEVICE_IE_CANINT					0x00008000
#define DEVICE_IE_LWU						0x00004000
#define DEVICE_IE_WKERR						0x00002000
#define DEVICE_IE_FRAME_OVF					0x00001000
//Reserved									0x00000800
#define DEVICE_IE_CANSLNT					0x00000400
#define DEVICE_IE_CANTO						0x00000200
#define DEVICE_IE_CANDOM					0x00000100
// Reserved									0x80-00

/* ************************************ *
 *		Partial Networking Registers	*
 *			(TCAN4650 Only)				*
 * ************************************ */
// Register addresses
#define SW_CFG1								0x2000
#define SW_CFG2								0x2004
#define SW_CFG3								0x2008
#define SW_CFG4								0x200C
#define SW_CNTRL1							0x2010
#define SW_CNTRL2							0x2014
#define SW_CNTRL3							0x2018
#define SW_CNTRL4							0x201C

// Selective Wake Config 1
#define SW_CFG1_IDE							0x00002000

// Selective Wake Control 1 (0x2010)
#define SW_CNTRL1_FRM_DET_EN				0x00000002
#define SW_CNTRL1_SPI_BUS_PRIORITY			0x00000001

// Selective Wake Control 3 (0x2018)
#define SW_CNTRL3_SAMPLE_DIV_1				0x00000000
#define SW_CNTRL3_SAMPLE_DIV_2				0x00000001
#define SW_CNTRL3_SAMPLE_DIV_3				0x00000004
#define SW_CNTRL3_SAMPLE_DIV_4				0x00000002
#define SW_CNTRL3_SAMPLE_DIV_5				0x00000003
#define SW_CNTRL3_SAMPLE_DIV_6				0x0000000C
#define SW_CNTRL3_SW_CONFIGURED				0x00000080
#define SW_CNTRL3_CANSYNC_FD				0x00000040
#define SW_CNTRL3_CANSYNC					0x00000020

//define the initial configuration value
#define  MCAN_DBTP_CONFIGVALUE    0x00000A33     //0x100C
#define  MCAN_TEST_CONFIGVALUE    0x00000000     //0x1010
#define  MCAN_RAMWD_CONFIGVALUE   0x00000000     //0x1014
#define  MCAN_CCCR_CONFIGVALUE    0x00000001     //0x1018
#define  MCAN_NBTP_CONFIGVALUE    0x06000A03     //0x101C
#define  MCAN_TSCC_CONFIGVALUE    0x00000000     //0x1020
#define  MCAN_TOCC_CONFIGVALUE    0xFFFF0000     //0x1028
#define  MCAN_TDCR_CONFIGVALUE    0x00000000     //0x1048
#define  MCAN_IR_CONFIGVALUE      0x00000000     //0x1050
#define  MCAN_IE_CONFIGVALUE      0x00000000     //0x1054
#define  MCAN_ILS_CONFIGVALUE     0x00000000     //0x1058
#define  MCAN_ILE_CONFIGVALUE     0x00000000     //0x105C
#define  MCAN_GFC_CONFIGVALUE     0x00000000     //0x1080
#define  MCAN_SIDFC_CONFIGVALUE   0x00000000     //0x1084
#define  MCAN_XIDFC_CONFIGVALUE   0x00000000     //0x1088
#define  MCAN_XIDAM_CONFIGVALUE   0x1FFFFFFF     //0x1090
#define  MCAN_RXF0C_CONFIGVALUE   0x00000000     //0x10A0
#define  MCAN_RXF1C_CONFIGVALUE   0x00000000     //0x10B0
#define  MCAN_RXESC_CONFIGVALUE   0x00000000     //0x10BC
#define  MCAN_TXBC_CONFIGVALUE    0x00000000     //0x10C0
#define  MCAN_TXESC_CONFIGVALUE   0x00000000     //0x10C8
#define  MCAN_TXBTIE_CONFIGVALUE  0x00000000     //0x10E0
#define  MCAN_TXBCIE_CONFIGVALUE  0x00000000     //0x10E4
#define  MCAN_TXEFC_CONFIGVALUE   0x00000000     //0x10F0

#define  DEV_MODES_CONFIGVALUE    0xC7004048
#define  DEV_TSTAMP_CONFIGVALUE   0x00000002
#define  DEV_TEST_CONFIGVALUE     0x00000000
#define  DEV_IE_CONFIGVALUE       0x00000000
